{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0015d\u0002\u0000\u0018S(\u0003\u0000\u0000\u0000Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000sD\u0000\u0000\u0000/Users/kyleguan/Documents/ML_python/tensorflow/P3/train_resize_v1.pyt\b\u0000\u0000\u0000<lambda>W\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 40, 80, 3], "output_shape": [40, 80, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 8, "subsample": [4, 4], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 8}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_13"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_14"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "nb_row": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_7"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_15"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 512}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_8"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_16"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 1}}]}